tutorials/fluids/cylinderInChannelFerzigerPeric/overset/movingCylinder/Allrun
#!/bin/sh

# Source tutorial clean functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication fluentMeshToFoam -writeZones CIC.msh
cp boundary ./constant/polyMesh

runApplication solids4Foam
